// !!!  ДЗ 16. Рекурсивне зведення в ступінь

// ??? Реалізувати рекурсивну функцію, яка зводить число в ступінь.
// ??? Ступінь передається як другий аргумент у функцію
// ??? pow (num, degree)

// !!! Рішення

/*
я використав формулу : pow(num, degree) = num * pow(num, degree - 1)
також прийшлось врахувати умову коли ступінь = 0 та відємна ступінь (та нажаль, в мене виходить помилка)
*/

function pow(num, degree) {
   if (degree === 0) {
      return 1;
   } if (degree < 0){
      return num**degree;
   } if (degree !== 1) { 
     return (num * pow(num, degree - 1));
   }  else {
     return num;
   }
 }

 console.log( pow(4, -5) );  // 7 в -2 = 0.020408...
