// !!!  ДЗ 25. Голосування

// Створити програму для відображення результатів голосування.
// З наступними умовами:
// Як варіанти відповіді - смайлики. За замовчуванням, 5шт.
// Виведення даних - смайлики в один рядок, під ними - кількість тих, хто проголосував за кожен смайл.
// При натисканні на смайл - під ним змінюється значення лічильника.
// Реалізувати таким чином, щоб додавання нових варіантів відповіді не вело до додавання нових функцій.

// !!  Ріщення

/*
1. знаходимо всі смайли
2. слухаємо, чи натискають на один із них
2. якщо нажали, то шукаємо сусідній елемент <p> і його значення і добавляємо йому +1
*/

const images = document.querySelectorAll("img");
images.forEach ((img) => {img.addEventListener("click", clickOnSmile)});

function clickOnSmile (){
  const counterPicture = this.nextElementSibling;
  counterPicture.textContent = Number(counterPicture.textContent) + 1;
}